<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"0c648555db289169879d5904780f894c2b3d20d1544e8407586d4e85ae451f99","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1238 at https://github.com/cal-itp/data-infra/actions/runs/20580784636","plan_out_hash":"0a4235c493a535f52b0eb787e5bac2d649a1949a73a08a8c95a8a2727f91dc78","plan_hash":"022c61904e93a43050150cd9c305e1189cd09d493765a98d03400f730130cd63","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 2 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_all_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "YupoWA==" -> (known after apply)
!~      detect_md5hash      = "k8gtTf8qMllxMyvmMti80Q==" -> "different hash"
!~      generation          = 1763685484873267 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_all_dag.py"
!~      md5hash             = "k8gtTf8qMllxMyvmMti80Q==" -> (known after apply)
        name                = "dags/dbt_all_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/dbt_manual_dag.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "/SQyEw==" -> (known after apply)
!~      detect_md5hash      = "PS6O2bAmQG8Pmb24efxDgA==" -> "different hash"
!~      generation          = 1763685485222363 -> (known after apply)
        id                  = "calitp-staging-composer-dags/dbt_manual_dag.py"
!~      md5hash             = "PS6O2bAmQG8Pmb24efxDgA==" -> (known after apply)
        name                = "dags/dbt_manual_dag.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/parse_littlepay_v3/slorta.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/parse_littlepay_v3/slorta.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/parse_littlepay_v3/slorta.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/sync_littlepay_v3/slorta.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/sync_littlepay_v3/slorta.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/sync_littlepay_v3/slorta.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "bIaRmg==" -> (known after apply)
!~      detect_md5hash      = "vYYJyte+TgoJI8tQE4HjJg==" -> "different hash"
!~      generation          = 1766180951155410 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "vYYJyte+TgoJI8tQE4HjJg==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "7trhdQ==" -> (known after apply)
!~      detect_md5hash      = "/uh/Sy2PN59xJ0QYT8Jqgw==" -> "different hash"
!~      generation          = 1766180952558865 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "/uh/Sy2PN59xJ0QYT8Jqgw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1238](https://github.com/cal-itp/data-infra/actions/runs/20580784636)